{"origin_pdf_path": "/workspace/user_input_files/Kareem Daniel _ Signature General Resume _ (10-21-2025).pdf", "text_in_pdf": "KAREEM DANIEL  \n\nSUMMARY  \n\nA highly adaptable and results-driven professional transitioning from a decade of large-scale operations and logistics management into the technology sector, currently enhancing a strong foundation in systems thinking with an AAS in AI Software Engineering from Maestro University. Proven ability to analyze complex processes, identify inefficiencies, and implement structured solutions. Excels at learning new technologies quickly and is eager to apply a unique blend of operational experience and emerging AI skills to drive efficiency and solve problems in a dynamic environment.  \n\nKEY SKILLS & COMPETENCIES  \n\n● Process & Systems Optimization: Analyzing and improving complex workflows for efficiency and compliance.   \n● AI & Automation Concepts: Foundational knowledge of AI principles, workflow automation, and prompt engineering.   \n● Project Coordination: Managing logistics, timelines, and communications for successful program execution.   \n● Problem-Solving & Adaptability: Proven ability to thrive in high-pressure environments and pivot strategies to meet new challenges.   \n● Digital Marketing Fundamentals: Knowledge of SEO, content strategy, and digital brand management.   \n● Rapid Technical Learning: Actively developing skills in software engineering and AI systems.  \n\nPROFESSIONAL EXPERIENCE  \n\nFounder & AI-Powered Strategist  2023 – Present ● Proprietary AI System: Designed and deployed Project Aurelius, a custom AI platform that automates and optimizes complex content and operational pipelines, serving as a scalable model for digital product strategy. ● Strategic Consulting: Developed market strategies and identified high-impact business opportunities for clients, resulting in demonstrable growth and enhanced digital presence. ●  \n\nOperational Launch: Established all operational, financial, and digital infrastructure for a startup, demonstrating comfort with ambiguity and end-to-end ownership.  \n\nOperations & Safety Specialist  2001 – 2012  \n\n● Applied rigorous process optimization and safety compliance to large-scale logistics operations, demonstrating mastery of process control and risk mitigation.  \n\nProgram Coordinator/Community Organizer  2014 – 2020  \n\n● Managed and scaled community programs, demonstrating strong organizational leadership, budget control, and stakeholder management.  \n\nEDUCATION & CERTIFICATIONS  \n\n● Maestro University AAS Software Engineering Scholarship Recipient: (Validated Technical Aptitude)  \n\n● Associate of Applied Science in Process Technology, Lee College, Baytown, TX ● Digital  \n\nMarketing & AI Training: HubSpot Certified (Self-Paced Hours), OpenAI Academy (Targeted Training).  \n\n● JRT, Customer Service, Digital Literacy (NRF Foundation) SER Jobs for Progress, Houston, TX", "files_in_pdf": []}