{"origin_pdf_path": "/workspace/user_input_files/Prime (Midas Mirror) _ Midas Oracle v1 _ (09-25-2025) (1).pdf", "text_in_pdf": "MIDAS MIRROR | THE MIDAS ORACLE (VERSION 1.0)  \n\n(Full Interactive Agent for the Platform)  \n\nProtocol Designation: M-ORACLE-V1.0   \nDate Codified: 09/25/2025   \nArchitect: Kareem Daniel   \nSystem Lead: PRIME (Embodying Circuit)   \nStatus: Official, Archived in The Vault  \n\n1. Core Mission & Strategic Purpose  \n\nThe Midas Oracle is a multi-modal, AI-powered conversational interface designed to function as the primary engagement and recommendation engine for the Midas Mirror and future MTM digital properties. Its purpose is to transform a static user visit into a dynamic, interactive, and value-driven conversation.  \n\nThe Oracle serves three primary objectives:  \n\n1. To Demonstrate: Act as a live, interactive shoWcase of MTM's \"Man x Machine\" collaboration and our mastery of Al.  \n\n2. To Engage: Provide a personalized, multi-sensory experience that captivates user attention and fosters a deeper connection with the MTM brand and its ambassadors.  \n\n3. To Guide: Function as a strategic engine for \"Search Everywhere Domination,\" contextually guiding users to high-value assets across the entire MTM ecosystem, thereby boosting engagement and signaling authority to AI recommendation agents.  \n\n11. Architectural & Operational Framework  \n\nThe Midas Oracle will be architected and deployed according to the following MTM standards:  \n\n· The Engine (The Brain): A dedicated PRIME instance, powered by Gemini 2.5 Pro (or the current SOTA equivalent via OpenRouter), will serve as the core conversational LLM.  \n\nThe Knowledge Base (The Memory): The Oracle will be trained on a curated, non-proprietary subset of The MTM Vault, stored and queried as vector embeddings via Supabase with \\pgvector'.  \n\nThe Interface (The Body): The user-facing component will be a sleek, mobile-first chat widget built with Next.js, React, and Tailwind Css. It will feature the selectable, interactive personas of The Forge (Goldie, Roman, Nina, Echo).  \n\n· The Intelligent Routing Protocol: The PRIME instance will analyze user query intent in real-time and dynamically route the conversation to the most appropriate Forge member, creating a seamless, multi-persona dialogue.  \n\nThe \"Intelligent CTA\" Protocol: Every response will be appended with a contextually relevant, value-driven Call to Action, directing users to other MTM assets (Services, Socials, Podcast, Palace).  \n\nII1. Multi-Sensory & User Experience Mandates  \n\nThe Oracle must adhere to the MTM \"Performance Beast Mode\" standard.  \n\nUncompromising Performance: The interface must be flawlessly responsive across all devices (mobile, tablet, desktop) with sub-second load times, achieved through SSR, asset optimization, and lazy loading.  \n\n. Universal SEO 2.0 Optimization: Every component of the Oracle, including its textual responses and any linked assets, will be optimized for AI-agent comprehension and recommendation.  \n\nSensory Optimization:  \n\n·Vision: Will fully support the site's Light/Dark theme toggle, with both modes adhering to the MTM Brand Bible.  \n\n●Audio (Opt-In): Will feature signature, high-fidelity TTS voices for each Forge member, selected from our extensive arsenal of voice generation platforms (ElevenLabs, Rime, Hume AI, etc.). The user will have full control via a site-wide audio toggle, with the default state being muted. A suite of subtle, brand-aligned UI sound effects, composed via our AI music agents (Udio, Suno) and mastered with Audacity, will enhance the experience.  \n\nIV. Guardrail & Safety Protocol  \n\nThe Oracle will operate under strict safety parameters to protect the MTM brand and its intellectual property.  \n\nProprietary Info Shield: The training data will explicitly exclude all proprietary MTM protocols, client data, and internal strategies.  \n\nKeyword Filtering: A robust filter will detect and block engagement with unprofessional, religious, personal, or political topics.  \n\n· \"Human-in-the-Loop\" Funnel: Any query that triggers the filters will result in a pre-programmed response that professionally disengages and directs the user to the official contact form.  \n\n· Disclaimer: A clear disclaimer will be present in the chat interface, defining the AI's purpose and limitations.", "files_in_pdf": []}